# # Python сынағы – қараша

# 1-cұрақ:
# Төмендегі Python деректер құрылымдарының қайсысы өзгермелі болып табылады?

# B. List

# 2-сұрақ:
# Python тілінде массивтің соңына элемент қосу үшін қандай әдіс қолданылады?

# C. append()

# 3-сұрақ:
# Python тілінде dictionary үшін clear() әдісінің негізгі мақсаты қандай?

# B. Барлық кілт-мән жұптарын жойыңыз

# 4-сұрақ:
# True немесе False: Python-дағы set-те қайталанатын элементтер болуы мүмкін.

# B. ЖАЛҒАН


# 5-сұрақ:
# Python тіліндегі тізім үшін pop() әдісі не істейді?

# C. Белгілі бір элементті жояды

# 6-сұрақ:
# Төмендегілердің қайсысы Python тілінде бос сөздік жасаудың жарамды әдісі болып табылады?

# А ЖӘНЕ Б

# 7-сұрақ:
# update() әдісі Python тіліндегі dictionary үшін не істейді?

# A. Жаңа кілт-мән жұбын қосады


# 8-сұрақ:
# True немесе False: Python тіліндегі массивті сөздікте мән(value) ретінде пайдалануға болады.


# A. РАС

# 9-сұрақ:
# Python-дағы set үшін intersection() әдісінің мақсаты қандай?

# B. Екі жиын арасындағы ортақ элементтерді қайтарады

# 10-сұрақ:
# Келесі код үзіндісінің нәтижесі қандай?
# my_list = [1, 2, 3, 4, 5]
# print(my_list[1:4])

# A. [2, 3, 4]

# 11-сұрақ:
# Python set пайдалану list пайдаланудан тиімдірек болатын сценарийді сипаттаңыз.

# set пайдалану дубликаттардың болуына жол бермейді. Яғни сетте белгілі бір деректердің копиялары болмайды. ал егер болса олар бірден жойылады. тек уникальный элементтер болады. Ал масивте онда 


# 12-сұрақ:
# Python массивтеріндегі  индексті түсіндіріңіз. Массивтегі элементтерді алу үшін индекс қалай қолданылатынын көрсету үшін мысал келтіріңіз.

# Индекстер 0-ден бастап саналады. Яғни ең бірінші тұрған элемент 0-ші элемент болып табылады. Егер бір элемент шығару керек болса біз оның индексін жазу арқылы шығарамыз.
# Мысалы; 
# l = "mfvmvkvmkmvvmfkf;fpfkn rifrofn fi4fnofn nfo4ifni4 fioj4fi4fo mv"
# print(g[31:54]) 31 элементтен бастап 54 ке дейін қиады
# келесі мысал
# k = "apple", "orange", "mango"
# print(k[2])

# 13-сұрақ:
# Сізге бүтін сандар массиві беріледі. Тізімдегі барлық жұп сандардың қосындысын табатын және басып шығаратын Python бағдарламасын жазыңыз.

# # Мысал:
# my_list =  [1, 2, 3, 4, 5, 6]
# h = 0
# for i in my_list:
#     if i % 2 == 0:
#         h += i 
# print(h)
# # Шығару: 12

# 14-сұрақ:
# Сізде қоймадағы заттардың санын көрсететін екі dictionary бар. Бірінші сөздікті екінші сөздіктегі мәндермен жаңартып, жаңартылған сөздікті басып шығаратын Python бағдарламасын жазыңыз.

# # Example:
# fruits = {'apple': 5, 'banana': 3}
# fruit ={'banana': 2, 'orange': 4}
# d = {}

# for i in fruits and fruit:
#     for p in i:
#         if "banana" in fruit:
            



# j = (fruits["banana"] + fruit['banana'])
# empty = {"apple": 5, "banana":5, "orange":4}
# print(empty)




# print(fruits["banana"])


# # Output: {'apple': 5, 'banana': 5, 'orange': 4}

# 15-сұрақ:
# Жолдар тізімін ескере отырып, тек «l» әрпінен басталатын жолдарды сүзетін және басып шығаратын Python бағдарламасын жазыңыз.

# # Example:
# fruits =  ['lychee', 'apple', 'banana', 'lemon', 'orange', 'grape', 'lime']
# zh = []
# for o in fruits:
#     if "l" in str(o[0]):
#         print(o)
# Output: [‘lychee’, 'lemon', 'lime']




